[
  {
    "questionEn": "Question text1",
    "answerEn": "Answer to Question",
    "questionEs": "Pregunta",
    "answerEs": "Respeuesta",
    "citation": "Reference for federal code or law",
    "author": "Lawyer's name",
    "firm": "Law Firm Name",
    "date": "date answer written",
    "lang":"en"
  },
  {
    "questionEn": "Question text2",
    "answerEn": "Answer to Question",
    "questionEs": "Pregunta",
    "answerEs": "Respeuesta",
    "citation": "Reference for federal code or law",
    "author": "Lawyer's name",
    "firm": "Law Firm Name",
    "date": "date answer written",
    "lang":"en"
  },
  {
    "questionEn": "As an immigrant, do I have access to the benefits offered by my state or local government?",
    "answerEn": "<p>All noncitizens are eligible for the following state or local government benefits:</p>\n<ul>\n<li>Emergency room care</li>\n<li>Non-cash, in-kind emergency disaster relief</li>\n<li>Public health assistance for vaccines and testing and treatment for contagious diseases</li>\n<li>Certain programs, services, or assistance (such as soup kitchens, crisis counseling and intervention, and short-term shelter) specified by the Attorney General, in the Attorney General's sole and unreviewable discretion after consultation with appropriate Federal agencies and departments, which (i) deliver in-kind services at the community level, including through public or private nonprofit agencies; (ii) do not condition the provision of assistance, the amount of assistance provided, or the cost of assistance provided on the individual recipient's income or resources; and (iii) are necessary for the protection of life or safety.</li>\n</ul>\n<p>As described below, a noncitizen may be eligible for other state or local government benefits if they are (1) a nonimmigrant, (2) a noncitizen who is paroled into the country for humanitarian reasons, or (3) a  “qualified noncitizen,” which includes lawful permanent residents, refugees, asylees, certain child and spousal abuse victims, and certain spouses and children of U.S. citizens.</p>\n<p>The following qualified noncitizens are entitled to state or local government benefits:</p>\n<ul>\n<li>Refugees, until 5 years after their date of entry into the country</li>\n<li>Asylees, until 5 years after the date they were granted asylum</li>\n<li>Lawful permanent residents who have worked for 40 qualifying quarters of coverage (10 years) under the Social Security Act or can be credited with such quarters, so long as the resident did not receive any federal means-tested public benefit for any such qualifying quarter creditable.</li>\n<li>A noncitizen who is on active duty (other than active duty for training) in the Armed Forces of the United States.</li>\n<li>A veteran who has been honorably discharged and who fulfills minimum active-duty service requirements.</li>\n<li>The spouse or unmarried dependent child of a noncitizen who is on active duty or who has been dishonorably discharged</li>\n<li>The unremarried surviving spouse of a deceased noncitizen who was on active duty or who has been dishonorably discharged</li>\n</p>If you do not fall into one of the above categories, you might still qualify for state or local government benefits. However, state and local governments may choose to deny access to their benefits to all other qualified noncitizens, as well as nonimmigrants and noncitizens who have been paroled into the country for humanitarian reasons. For information on whether your state or local government has denied access to these benefits, contact your state or local government benefits office.</p>\n<p>A state may choose to allow undocumented immigrants to access state and local government benefits. For information on whether your state government has allowed undocumented access to these benefits, contact your state government benefits office.</p>",
    "questionEs": "",
    "answerEs": "",
    "citation": "<a href=http://uscode.house.gov/view.xhtml?hl=false&edition=prelim&req=granuleid%3AUSC-prelim-title8-section1621&f=treesort&num=0&saved=%7CKHRpdGxlOjggc2VjdGlvbjoxNjExIGVkaXRpb246cHJlbGltKSBPUiAoZ3JhbnVsZWlkOlVTQy1wcmVsaW0tdGl0bGU4LXNlY3Rpb24xNjExKQ%3D%3D%7CdHJlZXNvcnQ%3D%7C%7C0%7Cfalse%7Cprelim”>8 U.S.C. § 1621</a>\n<a href=“ http://uscode.house.gov/view.xhtml?hl=false&edition=prelim&req=granuleid%3AUSC-prelim-title8-section1622&f=treesort&num=0&saved=%7CKHRpdGxlOjggc2VjdGlvbjoxNjExIGVkaXRpb246cHJlbGltKSBPUiAoZ3JhbnVsZWlkOlVTQy1wcmVsaW0tdGl0bGU4LXNlY3Rpb24xNjExKQ%3D%3D%7CdHJlZXNvcnQ%3D%7C%7C0%7Cfalse%7Cprelim”>8 U.S.C. § 1622</a>",
    "author": "Stephen Mortellaro",
    "firm": "Knowledge is Power",
    "date": "05/06/2017",
    "lang":"en"
  },
  {
    "questionEn": "As an immigrant, do I have access to the benefits offered by the federal government?",
    "answerEn": "<p>All noncitizens are eligible for the following federal government benefits:</p>\n    <ul><li>Emergency room care</li>\n    <li>Non-cash, in-kind emergency disaster relief</li>\n    <li>Federal public health assistance (excluding Medicaid and CHIP) for vaccines and testing and treatment for contagious diseases</li>\n    <li>Certain federal programs, services, or assistance that deliver in-kind services at the community level, including through public or private nonprofit agencies and not make the assistance dependent on a recipient's income or resources.</li>\n    </ul>\n    <p>Noncitizens may be eligible for other federal government benefits if they are “qualified noncitizens,” which includes lawful permanent residents, refugees, asylees, certain child and spousal abuse victims, and certain spouses and children of U.S. citizens.</p>\n    <p>The following qualified noncitizens may receive food stamps or supplement security income (SSI) benefits if they otherwise meet the eligibility requirements for these programs:</p>\n    <ul>\n    <li>Lawful permanent residents who have worked for 40 qualifying quarters of coverage (10 years) under the Social Security Act or can be credited with such quarters, so long as the resident did not receive any federal means-tested public benefit for any such qualifying quarter creditable.</li>\n    <li>Refugees and asylees who otherwise meet the eligibility requirements may receive food stamps and supplement security income (SSI) for up to 7 years after they are admitted to the country as a refugee or granted asylum.</li>\n    <li>A noncitizen who is on active duty (other than active duty for training) in the Armed Forces of the United States.</li>\n    <li>A veteran who has been honorably discharged and who fulfills minimum active-duty service requirements.</li>\n    <li>The spouse or unmarried dependent child of a noncitizen who is on active duty or who has been dishonorably discharged</li>\n    <li>The unremarried surviving spouse of a deceased noncitizen who was on active duty or who has been dishonorably discharged</li>\n    <li>American Indians are who members of Indian tribes</li>\n    <li>American Indians who were born in Canada and whose race is at least 50% American Indian</li>\n    </ul>\n    <p>Additionally, qualified noncitizens who are children may receive food stamps if they are otherwise eligible, and any noncitizen who has been a qualified noncitizen for at least 5 years may also apply for food stamps if they are otherwise eligible.</p>\n    <p>The following qualified noncitizens who are otherwise eligible may receive Medicaid, Temporary Assistance to Needy Families, and assistance through social services block grants:</p>\n    <ul>\n    <li>Lawful permanent residents who have worked for 40 qualifying quarters of coverage (10 years) under the Social Security Act or can be credited with such quarters, so long as the resident did not receive any federal means-tested public benefit for any such qualifying quarter creditable.</li>\n    <li>Refugees and asylees who otherwise meet the eligibility requirements may receive food stamps and supplement security income (SSI) for up to 7 years after they are admitted to the country as a refugee or granted asylum.</li>\n    <li>A noncitizen who is on active duty (other than active duty for training) in the Armed Forces of the United States.</li>\n    <li>A veteran who has been honorably discharged and who fulfills minimum active-duty service requirements.</li>\n    <li>The spouse or unmarried dependent child of a noncitizen who is on active duty or who has been dishonorably discharged</li>\n    <li>The unremarried surviving spouse of a deceased noncitizen who was on active duty or who has been dishonorably discharged</li>\n    <li> Any other qualified noncitizen who a state governments decides may receive such benefit.</li>\n    </ul>\n    <p>Additionally, the following qualified noncitizens are eligible for Medicaid benefits only:</p>\n    <ul>\n    <li>American Indians are who members of Indian tribes</li>\n    <li>American Indians who were born in Canada and whose race is at least 50% American Indian</li>\n    <li>Any qualified noncitizen who is receiving SSI.</li>\n    </ul>",
    "questionEs": "",
    "answerEs": "",
    "citation": "<a href=“http://uscode.house.gov/view.xhtml?req=(title:8%20section:1611%20edition:prelim)%20OR%20(granuleid:USC-prelim-title8-section1611)&f=treesort&edition=prelim&num=0&jumpTo=true”> 8 U.S.C. § 1611</a>\n<a href=“http://uscode.house.gov/view.xhtml?hl=false&edition=prelim&req=granuleid%3AUSC-prelim-title8-section1612&f=treesort&num=0&saved=%7CKHRpdGxlOjggc2VjdGlvbjoxNjExIGVkaXRpb246cHJlbGltKSBPUiAoZ3JhbnVsZWlkOlVTQy1wcmVsaW0tdGl0bGU4LXNlY3Rpb24xNjExKQ%3D%3D%7CdHJlZXNvcnQ%3D%7C%7C0%7Cfalse%7Cprelim”>8 U.S.C. § 1612</a>",
    "author": "Stephen Mortellaro",
    "firm": "Knowledge is Power",
    "date": "05/06/2017",
    "lang":"en"
  }
]
